app/services/importer.rb

INSERT INTO "articles" ("title", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Ruby"], ["body", "language programming"], ["created_at", "2023-01-18 13:51:36.451860"], ["updated_at", "2023-01-18 13:51:36.451860"]]
---

table.each do |t, b|
  @article = Article.new(title: t,body: b)
  @article.save